Revit 2027 API
RailingType.BalusterPlacement Property
 Accesses the object containing properties related to the baluster placement.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BalusterPlacement BalusterPlacement { get; }
Public ReadOnly Property BalusterPlacement As BalusterPlacement
	Get
public:
property BalusterPlacement^ BalusterPlacement {
	BalusterPlacement^ get ();
}
member BalusterPlacement : BalusterPlacement with get
Property Value
BalusterPlacement
See Also
Reference
RailingType Class
Autodesk.Revit.DB.Architecture Namespace